<a href="https://colab.research.google.com/github/AadarshS9/Computational-Statistics-S3/blob/main/Groupby_Aggregation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [40]:
import pandas as pd
ipl_data={'Team':['Riders', 'Riders', 'Devils', 'Devils', 'Kings','Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df)
print("\n")
print(df.groupby('Team').groups)
print("\n")
print(df.groupby(['Team','Year']).groups)
print("\n")
print(df.groupby(['Rank'],axis=1).groups)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690


{'Devils': [2, 3], 'Kings': [4, 5, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10]}


{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2015): [5], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}


{}

In [20]:
import pandas as pd
dataframe = pd.DataFrame({'id': [7058, 4511, 7014, 7033],'name': ['sravan', 'manoj', 'aditya', 'bhanu'],'Maths_marks': [99, 97, 88, 90],'Chemistry_marks': [89, 99, 99, 90],'telugu_marks': [99, 97, 88, 80],'hindi_marks': [99, 97, 56, 67],'social_marks': [79, 97, 78, 90], })
print(dataframe)
print("\n")
print(dataframe.describe())
print("\n")
print(dataframe['Maths_marks'].unique())
print("\n")
print(dataframe['Maths_marks'].nunique())
print("\n")
print(dataframe.columns)
print("\n")
print(dataframe.info())

     id    name  Maths_marks  Chemistry_marks  telugu_marks  hindi_marks  \
0  7058  sravan           99               89            99           99
1  4511   manoj           97               99            97           97
2  7014  aditya           88               99            88           56
3  7033   bhanu           90               90            80           67

   social_marks
0            79
1            97
2            78
3            90


                id  Maths_marks  Chemistry_marks  telugu_marks  hindi_marks  \
count     4.000000     4.000000             4.00       4.00000     4.000000
mean   6404.000000    93.500000            94.25      91.00000    79.750000
std    1262.128625     5.322906             5.50       8.75595    21.561926
min    4511.000000    88.000000            89.00      80.00000    56.000000
25%    6388.250000    89.500000            89.75      86.00000    64.250000
50%    7023.500000    93.500000            94.50      92.50000    82.000000
75%    7039.250000    97.500000            99.00      97.50000    97.500000
max    7058.000000    99.000000            99.00      99.00000    99.000000

       social_marks
count      4.000000
mean      86.000000
std        9.128709
min       78.000000
25%       78.750000
50%       84.500000
75%       91.750000
max       97.000000


[99 97 88 90]


4


Index(['id', 'name', 'Maths_marks', 'Chemistry_marks', 'telugu_marks',
       'hindi_marks', 'social_marks'],
      dtype='object')


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               4 non-null      int64
 1   name             4 non-null      object
 2   Maths_marks      4 non-null      int64
 3   Chemistry_marks  4 non-null      int64
 4   telugu_marks     4 non-null      int64
 5   hindi_marks      4 non-null      int64
 6   social_marks     4 non-null      int64
dtypes: int64(6), object(1)
memory usage: 352.0+ bytes
None

In [23]:
import pandas as pd
import numpy as np
dataframe = pd.DataFrame({'id': [7058, 4511, 7014, 7033],'name': ['sravan', 'manoj', 'aditya', 'bhanu'],'Maths_marks': [99, 97, 88, 90],'Chemistry_marks': [89, 99, 99, 90],'telugu_marks': [99, 97, 88, 80],'hindi_marks': [99, 97, 56, 67],'social_marks': [79, 97, 78, 90], })
print(dataframe)
print("\n")
print(dataframe.min())
print("\n")
print(dataframe['Maths_marks'].min())
print("\n")
print(dataframe.max())
print("\n")
print(dataframe.sum())
print("\n")
print(dataframe.count())
print("\n")
print(dataframe.std())
print("\n")
print(dataframe.var())

     id    name  Maths_marks  Chemistry_marks  telugu_marks  hindi_marks  \
0  7058  sravan           99               89            99           99
1  4511   manoj           97               99            97           97
2  7014  aditya           88               99            88           56
3  7033   bhanu           90               90            80           67

   social_marks
0            79
1            97
2            78
3            90


id                   4511
name               aditya
Maths_marks            88
Chemistry_marks        89
telugu_marks           80
hindi_marks            56
social_marks           78
dtype: object


88


id                   7058
name               sravan
Maths_marks            99
Chemistry_marks        99
telugu_marks           99
hindi_marks            99
social_marks           97
dtype: object


id                                  25616
name               sravanmanojadityabhanu
Maths_marks                           374
Chemistry_marks                       377
telugu_marks                          364
hindi_marks                           319
social_marks                          344
dtype: object


id                 4
name               4
Maths_marks        4
Chemistry_marks    4
telugu_marks       4
hindi_marks        4
social_marks       4
dtype: int64


id                 1262.128625
Maths_marks           5.322906
Chemistry_marks       5.500000
telugu_marks          8.755950
hindi_marks          21.561926
social_marks          9.128709
dtype: float64


id                 1.592969e+06
Maths_marks        2.833333e+01
Chemistry_marks    3.025000e+01
telugu_marks       7.666667e+01
hindi_marks        4.649167e+02
social_marks       8.333333e+01
dtype: float64

<ipython-input-23-2d4b9b11053e>:16: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(dataframe.std())
<ipython-input-23-2d4b9b11053e>:18: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(dataframe.var())

In [41]:
import pandas as pd
import numpy as np
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings','Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
grouped = df.groupby('Year')
print(grouped['Points'].agg(np.mean))
print("\n")
grouped = df.groupby('Team')
print(grouped.agg(np.size))
print("\n")
grouped = df.groupby('Team')
print(grouped['Points'].agg([np.sum, np.mean, np.std]))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64


        Rank  Year  Points
Team
Devils     2     2       2
Kings      4     4       4
Riders     4     4       4
Royals     2     2       2


         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3049  762.25   88.567771
Royals  1505  752.50   72.831998

In [44]:
import pandas as pd
import numpy as np
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings','kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df)
print("\n")
grouped = df.groupby('Team')
score = lambda x: (x - x.mean()) / x.std()*10
print(grouped.transform(score))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690


         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4   11.547005 -10.910895  -8.608621
5         NaN        NaN        NaN
6   -5.773503   2.182179  -2.360428
7   -5.773503   8.728716  10.969049
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

In [49]:
import pandas as pd
dataframe = pd.DataFrame({'id': [7058, 4511, 7014, 7033],'name': ['sravan', 'manoj', 'aditya', 'bhanu'],'Maths_marks': [99, 97, 88, 90],'Chemistry_marks': [89, 99, 99, 90],'telugu_marks': [99, 97, 88, 80],'hindi_marks': [99, 97, 56, 67],'social_marks': [79, 97, 78, 90], })
print(dataframe.groupby('name').first())
print("---------------------------------")
# group by name with social_marks sum
print(dataframe.groupby('name')['social_marks'].sum())
print("---------------------------------")
# group by name with maths_marks count
print(dataframe.groupby('name')['Maths_marks'].count())
print("---------------------------------")
# group by name with maths_marks
print(dataframe.groupby('name')['Maths_marks'].sum())

          id  Maths_marks  Chemistry_marks  telugu_marks  hindi_marks  \
name
aditya  7014           88               99            88           56
bhanu   7033           90               90            80           67
manoj   4511           97               99            97           97
sravan  7058           99               89            99           99

        social_marks
name
aditya            78
bhanu             90
manoj             97
sravan            79
---------------------------------
name
aditya    78
bhanu     90
manoj     97
sravan    79
Name: social_marks, dtype: int64
---------------------------------
name
aditya    1
bhanu     1
manoj     1
sravan    1
Name: Maths_marks, dtype: int64
---------------------------------
name
aditya    88
bhanu     90
manoj     97
sravan    99
Name: Maths_marks, dtype: int64